Revit 2026 API

# DoorEvacuationExitType Enumeration

---

An enumerated type listing the possible door evacuation types

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DoorEvacuationExitType
```
```vb
Public Enumeration DoorEvacuationExitType
```
```cpp
public enum class DoorEvacuationExitType
```
```fsharp
type DoorEvacuationExitType
```

| Member name | Value | Description |
| --- | --- | --- |
| ExteriorExit | 0 | Exterior exit door. |
| InteriorExit | 1 | Interior exit door. |
| InteriorPassage | 2 | Interior passage door. |
| None | 3 | Not used for exit access. |

#### Reference

Autodesk.Revit.DB Namespace